In [1]:
#11 Pandas

import pandas as pd

In [2]:
#pandas series

s = pd.Series([0,1,4,9,16,25])

In [3]:
s

0     0
1     1
2     4
3     9
4    16
5    25
dtype: int64

In [8]:
s.values

array([ 0,  1,  4,  9, 16, 25])

In [9]:
s[2]

4

In [33]:
pop2014 = pd.Series([100,99.3,95.5,93.5,92.4,84.8,84.5,78.9,74.3,72.8])

In [34]:
pop2014

0    100.0
1     99.3
2     95.5
3     93.5
4     92.4
5     84.8
6     84.5
7     78.9
8     74.3
9     72.8
dtype: float64

In [35]:
pop2014 = pd.Series([100,99.3,95.5,93.5,92.4,84.8,84.5,78.9,74.3,72.8],
                    index = ['Java','C','C++','Python','C#','php','JavaScript','Ruby','R','Matlab'])
pop2014

Java          100.0
C              99.3
C++            95.5
Python         93.5
C#             92.4
php            84.8
JavaScript     84.5
Ruby           78.9
R              74.3
Matlab         72.8
dtype: float64

In [36]:
pop2014.index[3], pop2014[3]

('Python', 93.5)

In [37]:
pop2014['Python']

93.5

In [38]:
pop2014['C++':'R']

C++           95.5
Python        93.5
C#            92.4
php           84.8
JavaScript    84.5
Ruby          78.9
R             74.3
dtype: float64

In [39]:
pop2014[pop2014 > 90]

Java      100.0
C          99.3
C++        95.5
Python     93.5
C#         92.4
dtype: float64

In [40]:
pop2015 = pd.Series({'Java':100,
                     'C':99.3,
                     'C++':95.5,
                     'Python':93.5,
                     'C#':92.4,
                     'R':74.3,
                     'php':84.8,
                     'JavaScript':84.5,
                     'Ruby':78.9,
                     'Matlab':72.8})

In [41]:
pop2015

C              99.3
C#             92.4
C++            95.5
Java          100.0
JavaScript     84.5
Matlab         72.8
Python         93.5
R              74.3
Ruby           78.9
php            84.8
dtype: float64

In [42]:
#pandas Data Frame

twoYears = pd.DataFrame({'2014':pop2014,'2015':pop2015})

In [43]:
twoYears

             2014   2015
C            99.3   99.3
C#           92.4   92.4
C++          95.5   95.5
Java        100.0  100.0
JavaScript   84.5   84.5
Matlab       72.8   72.8
Python       93.5   93.5
R            74.3   74.3
Ruby         78.9   78.9
php          84.8   84.8

In [44]:
#index lookup using numeric position

twoYears.iloc[0:2]

    2014  2015
C   99.3  99.3
C#  92.4  92.4

In [49]:
#index lookup using labels

twoYears.loc['C':'Python']

             2014   2015
C            99.3   99.3
C#           92.4   92.4
C++          95.5   95.5
Java        100.0  100.0
JavaScript   84.5   84.5
Matlab       72.8   72.8
Python       93.5   93.5

In [52]:
#first parameter is the row indexer and the second is the column indexer

twoYears.ix[:,['2015']]

/Users/3kx07/anaconda/lib/python3.6/site-packages/ipykernel_launcher.py:3: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate_ix
  This is separate from the ipykernel package so we can avoid doing imports until

             2015
C            99.3
C#           92.4
C++          95.5
Java        100.0
JavaScript   84.5
Matlab       72.8
Python       93.5
R            74.3
Ruby         78.9
php          84.8

In [56]:
presidents = pd.DataFrame([{'name':'Donald Trump',
                            'inauguration':2017,
                            'birthday':1946},
                           {'name':'Barack Obama',
                           'inauguration':2009,
                            'birthday':1961},
                           {'name':'George W. Bush',
                           'inauguration':2001,
                            'birthday':1946},
                           {'name':'Bill Clinton',
                           'inauguration':1993,
                            'birthday':1946}])

In [57]:
presidents

   birthday  inauguration            name
0      1946          2017    Donald Trump
1      1961          2009    Barack Obama
2      1946          2001  George W. Bush
3      1946          1993    Bill Clinton

In [61]:
presidents_indexed = presidents.set_index('name')

In [63]:
presidents_indexed

                birthday  inauguration
name
Donald Trump        1946          2017
Barack Obama        1961          2009
George W. Bush      1946          2001
Bill Clinton        1946          1993

In [73]:
presidents_fathers = pd.DataFrame([{'son':'Barack Obama',
                                    'father':'Barack Obama Sr'},
                                   {'son':'Donald Trump',
                                    'father':'Fred Trump'},
                                   {'son':'George W. Bush',
                                    'father':'George H. Bush'}])

In [74]:
presidents_fathers

            father             son
0  Barack Obama Sr    Barack Obama
1       Fred Trump    Donald Trump
2   George H. Bush  George W. Bush

In [76]:
#merging the two data frame

pd.merge(presidents, presidents_fathers, left_on='name', right_on='son')

   birthday  inauguration            name           father             son
0      1946          2017    Donald Trump       Fred Trump    Donald Trump
1      1961          2009    Barack Obama  Barack Obama Sr    Barack Obama
2      1946          2001  George W. Bush   George H. Bush  George W. Bush

In [78]:
#remove the son column

pd.merge(presidents, presidents_fathers, left_on='name', right_on='son').drop('son', axis=1)

   birthday  inauguration            name           father
0      1946          2017    Donald Trump       Fred Trump
1      1961          2009    Barack Obama  Barack Obama Sr
2      1946          2001  George W. Bush   George H. Bush

In [83]:
pd.merge(presidents, presidents_fathers, left_on='name', right_on='son').drop(0)

   birthday  inauguration            name          father             son
0      1946          2017    Donald Trump      Fred Trump    Donald Trump
2      1946          2001  George W. Bush  George H. Bush  George W. Bush